app/controllers/admin/blogs_controller.rb

SELECT * FROM `blogs` WHERE (((`blogs`.`verified` IN (0,1))) AND (`blogs`.`verified` IN (0,1))) ORDER BY created_at DESC LIMIT 0, 20
---
  def index
    @blogs = Blog.unverified.paginate :page => params[:page], :per_page => 20