app/controllers/admin/photos_controller.rb

  def index
    @photos = Photo.unverified.paginate :page => params[:page], :per_page => 20
---
SELECT * FROM `photos` WHERE (((`photos`.`verified` IN (0,1))) AND (`photos`.`verified` IN (0,1))) ORDER BY created_at DESC LIMIT 0, 20