app/controllers/admin/sharings_controller.rb

SELECT * FROM `sharings` WHERE (`sharings`.`verified` = 0) ORDER BY created_at DESC LIMIT 0, 20
---
  def index
    @sharings = Sharing.unverified.paginate :page => params[:page], :per_page => 20