app/controllers/admin/statuses_controller.rb

SELECT * FROM `statuses` WHERE (`statuses`.`verified` = 0) ORDER BY created_at DESC LIMIT 0, 20
---
  def index
    @statuses = Status.unverified.paginate :page => params[:page], :per_page => 20