app/controllers/admin/tags_controller.rb

SELECT * FROM `tags` WHERE (`tags`.`verified` = 0) ORDER BY created_at DESC LIMIT 0, 20
SELECT count(*) AS count_all FROM `tags` WHERE (`tags`.`verified` = 0)
---
  def index
    @tags = Tag.unverified.paginate :page => params[:page], :per_page => 20