app/controllers/admin/videos_controller.rb

SELECT * FROM `videos` WHERE (((`videos`.`verified` IN (0,1))) AND (`videos`.`verified` IN (0,1))) ORDER BY created_at DESC LIMIT 0, 20
---
  def index
    @videos = Video.unverified.paginate :page => params[:page], :per_page => 20